[
{"name": "+Simple", "description": "+Simple is a financial services platform for freelancers, small and medium-sized businesses. Our proprietary “Robot-Broker”​ technology is a full-stack insurance broker powered by artificial intelligence (AI). Answer five to 10 questions and +Simple generates a competitive and tailor-made insurance package for your business (typically including five to 10 products). Within five minutes, our clients can customize it, sign it, pay for it and get back to work, insured. And +Simple manage claims, too.", "sectors": "Insurance & risk management", "headquarters": "France"},
{"name": "ABAKA", "description": ["ABAKA has created an AI-driven recommendation engine that gives the financial industry the means to engage with their customers and to create hyper-personalized experiences through predictive Next Best Actions and Intelligent Nudges. ", "Harnessing the power of Machine Learning and Natural Language Processing, ABAKA’s AI-powered Next Best Action augment your customer data with other sources of data to predict and deliver the relevant Next Best Action to the right customer, through the right channel, at the right time. Our SaaS platform and solutions help over 10 million customers and policy holders to receive hyper personalized recommendation on products such as credit cards, loans, savings, retirement, life and non-life insurance. "], "sectors": "Data, Technology & Infrastructure", "headquarters": "UK"},
{"name": "ABAKA", "description": "Sectors", "sectors": "Data, Technology & Infrastructure", "headquarters": "UK"},
{"name": "Wayhome", "description": "Founded in 2016, Wayhome provides a new way to for people to access homeownership, with its pioneering part-own part-rent system. Pairing buyers with institutional investors, Wayhome centres around making home ownership fairer, offering stable returns while customers remain in control of their living situation. In 2018, Wayhome raised the largest seed round in Europe for a fintech and is partnered with AllianzGI to raise funds from institutional clients, to support the purchase of homes around the UK.", "sectors": "Retail banking & consumer finance", "headquarters": "UK"},
{"name": "TrueLayer", "description": "TrueLayer solves the big problem of connecting applications with bank infrastructure and giving them access to a clean, standardized and categorized view of their customers’ account balances, transactions and credit card data.", "sectors": "Data, technology & infrastructure", "headquarters": "London"},
{"name": "Tide", "description": "Tide is a nimble banking service designed specifically for small businesses and sole traders to help them save time and money.", "sectors": "Business & Corporate Banking", "headquarters": "UK"},
{"name": "Simple", "description": "Simple is banking remade with built-in tools for budgeting and saving, beautiful design and genuine human goodness. The company focuses on elegant interfaces, transparent policies, modern technology and extraordinary customer service to help people feel confident with their money. Customers’ accounts are held and insured by The Bancorp Bank, a member of the Federal Deposit Insurance Corporation (FDIC). Simple lives online, but the people who make it mostly live in Portland, Oregon. Simple was acquired by BBVA for $117 million in February, 2014.", "sectors": "Retail banking & consumer finance", "headquarters": "USA"},
{"name": "Tremor", "description": " serves on the board of Tremor.", "sectors": "Insurance & risk management", "headquarters": "USA"},
{"name": "REalyse", "description": "REalyse is a technology company that helps UK residential property professionals stay ahead of the market. REalyse provides companies with smart technology, real estate expertise and independently sourced data—house prices, rents, yields, demographics, market activity, economics, debt and all things in between.", "sectors": "Data, Technology & Infrastructure", "headquarters": "UK"},
{"name": "Quantopian", "description": "Quantopian is a crowd-sourced quantitative investment company, inspiring people from around the world to write investment algorithms.", "sectors": "Capital markets & trading", "headquarters": "USA"},
{"name": "Qapital", "description": "Qapital is an everyday banking app that allows customers to create goals, decide their own rules and watch their savings grow. Through the app, customers can automatically transfer funds in small increments to save based on rules they set.", "sectors": "Retail banking & consumer finance", "headquarters": "USA"},
{"name": "Rally Rd.", "description": "Rally Rd. is a first-of-its-kind platform where unique, high-value assets are securitized, split into shares, then offered as equity investments to users of all income levels. The mission: to democratize alternative asset investing by providing access, liquidity and transparency to markets that have traditionally only been available to a select few. Rally Rd. completed the first ever initial offering for a vehicle in 2017.", "sectors": "Wealth & asset management", "headquarters": "USA"},
{"name": "Neptune Networks", "description": "Neptune Networks delivers high-quality bond market data from sell-side banks to buy-side clients. Our technology enables real-time connectivity between banks and investors which leads to meaningful conversations, satisfying the immediate requirements of each party and ultimately, increasing trade volumes. We are uniquely positioned in the marketplace, as we have a bilateral commitment from buy-side and sell-side, including representatives of each sitting on our board.", "sectors": "Data, technology & infrastructure", "headquarters": "UK"},
{"name": "Moven", "description": "Moven provides a secure cloud-based software solution to financial institutions on five continents with over 10 million users. The express goal is to offer the best integrated financial wellness experience and  contextual banking capabilities to financial institutions via mobile, web, and voice.", "sectors": "Retail banking & consumer finance", "headquarters": "USA"},
{"name": "Monese", "description": "Monese is an online banking service that aims to provide better banking for individuals and businesses. The company’s pricing and operating model enables an alternative banking experience without fees or time-consuming bureaucracy. Monese was designed to meet customers’ everyday needs and therefore offers all the modern banking facilities, such as online and mobile banking, cash withdrawals, card payments and international money transfers. Because Monese does not run credit checks and the entire registration process is carried out online, customers can get an account within minutes and use the services immediately.", "sectors": "Retail Banking & Consumer Finance", "headquarters": "UK"},
{"name": "Koffie Labs", "description": "Koffie Labs uses telematics and advanced safety technology to underwrite trucking companies, rewarding fleets that invest in safety with discounted insurance premiums. Truckers, used to waiting weeks for quotes, can receive one in minutes on Koffie’s streamlined and fully digital platform. Koffie’s AI-driven predictive models, which underwrite dozens of safety features, allow the company to build insurance for emerging risks like self-driving vehicles.", "sectors": "Insurance and risk management", "headquarters": "USA"},
{"name": "Humanising Autonomy", "description": "Humanising Autonomy is setting the global standard for human-machine interactions. The company has developed an intent prediction technology that predicts the full range of pedestrian behaviour across different environments and cities. As a critical perception technology, the software integrates with driver assistance systems, autonomous vehicle stacks, and smart infrastructure systems for real-time accident and near miss prevention, improving the safety and efficiency of Urban Mobility Systems across cities worldwide. The company consists of a half-female team of computer vision experts, deep learning engineers, behavioural scientists, and commercial talent, and is actively hiring for both commercial and tech roles to grow and accelerate towards their vision of better interactions between people and autonomous technology worldwide.", "sectors": "Insurance & risk management", "headquarters": "UK"},
{"name": "HappyMoney", "description": "HappyMoney (fka Payoff) is a team of financial services professionals, research and clinical psychologists, data scientists, neuroscientists, Member Advocates and technology experts working together to better understand and accelerate people’s journey toward financial wellness.", "sectors": "Retail banking & consumer finance", "headquarters": "USA"},
{"name": "Goji", "description": "Goji empowers P2P and direct lending platforms to reach new investor markets. The company’s platform aims to manage the risks and capture the opportunities of investing in direct lending.", "sectors": "Wealth & Asset Management", "headquarters": "UK"},
{"name": "Kindur", "description": "Kindur is a new kind of financial company that helps baby boomers embrace modern retirement. The company’s signature retirement paycheck puts customers in the driving seat to retire fearlessly.", "sectors": "Wealth & Asset Management", "headquarters": "US"},
{"name": "Goin", "description": "Goin is the first app in Spain that allows users to achieve their financial goals through automatic savings and invest in an effective, easy and safe way. By connecting their banking account, Goin users activate simple saving methods that help them to save without even realizing it. Founded in Barcelona in 2018, Goin was created in response to the Spanish consumer’s need to obtain the maximum return on their money without needing to be a financial expert. Goin’s mobile application was rated as best in the world in Silicon Valley according to AngelHack, the largest hacker community.", "sectors": "Retail banking & consumer finance", "headquarters": "Spain"},
{"name": "Fluidly", "description": "Fluidly is fundamentally rethinking the way businesses plan and manage cashflow, using data science, accounting domain expertise and machine learning.", "sectors": "Business & Corporate Banking", "headquarters": "UK"},
{"name": "Flock", "description": "Flock is a London-based, venture capital (VC) and government-backed insurtech startup, pioneering the use of big data to intelligently price and sell insurance. In January 2018, Flock launched its first product, “Flock Cover”: a ‘pay-as-you-fly’ insurance and safety application for drone pilots.", "sectors": "Insurance & risk management", "headquarters": "UK"},
{"name": "Imandra", "description": "Imandra is a cloud-native automated reasoning engine. Aesthetic Integration is an AI startup developing Imandra, the cloud-scale automated reasoning system.", "sectors": "Data, technology & infrastructure", "headquarters": "UK"},
{"name": "Fidor", "description": "Fidor Bank is Europe’s original digital challenger bank, pioneering the collaboration between traditional financial services and technology businesses. Fidor’s banking concept provides an online community for people to provide and receive financial advice, giving users rewards for doing so such as cash, improved current account and savings bond interest rates. All of its banking services can be done online in under 60 seconds. Fidor also acts as a marketplace for its customers, giving them access to a large selection of financial services and products through its partnerships. The company launched its retail banking offer in the UK in September, 2015 and plans to expand its services into Europe in the coming months. It has over 350,000 online community members in Germany and the UK with a customer base of over 120,000.", "sectors": "Retail banking & consumer finance", "headquarters": "Germany"},
{"name": "Ember", "description": "Sectors", "sectors": "Business and Corporate Banking", "headquarters": "London"},
{"name": "Bento", "description": "Bento for Business is dedicated to modernizing the way small- and mid-size businesses manage and unlock value from their working capital. Bento is the partner of choice for businesses that want a modular financial operating platform for their cash flow and financial management needs. Bento’s strategic partners also expand to the banks, payment networks and processors that want to provide digital treasury management and business banking suite options for their customers. Co-located in Chicago and San Francisco, Bento is an award-winning SMB fintech solution led by veteran financial services executives and backed by leading financial technology investors. For additional information, visit ", "sectors": "Business & corporate banking", "headquarters": "USA"},
{"name": "Backstage Capital", "description": "Backstage Capital is a venture capital fund investing in the best startups led by underrepresented founders in the US.", "sectors": "Funds", "headquarters": "USA"},
{"name": "Arthena", "description": "Arthena is a financial product that enables access to the alternative asset class with the highest barrier to entry and strongest historical returns. They invest in the most liquid segment of the art market, with the lowest volatility, yielding tremendous growth uncorrelated to traditional investments. Arthena’s automated and data driven investment strategy regulates art investment by building traditional fund structures. High Net Worth Individuals (HNWIs) can now securely and confidently diversify their portfolios into alternative assets focusing on the luxury market.", "sectors": "Wealth & asset management", "headquarters": "USA"},
{"name": "Atom Bank", "description": "Atom Bank is a new, online-only banking platform with a focus on retail and SME customers. It reorients the focus of banking to the needs and wants of the consumer by providing a totally app-based experience. The result is a faster and more convenient approach to banking.", "sectors": "Business & corporate banking", "headquarters": "UK"}
]